@jmborsani based on the error message, it looks like you've passed both `basic`, `standard` somehow.

Could you try the following instead? So if you've got `example` directory and then create 3 files: `main.tf`, `variables.tf`, `terraform.tfvars`:

* `main.tf`:
```
# main.tf
# Example for using Confluent Cloud https://docs.confluent.io/cloud/current/api.html
# that creates multiple resources: a service account, an environment, a basic cluster, a topic, and 2 ACLs.
# Configure Confluent Cloud provider
terraform {
  required_providers {
    confluentcloud = {
      source  = "confluentinc/confluentcloud"
      version = "0.5.0"
    }
  }
}

provider "confluentcloud" {}

resource "confluentcloud_kafka_cluster" "example" {
  display_name = var.example_kafka_cluster_name
  availability = "SINGLE_ZONE"
  cloud        = "AZURE"
  region       = var.azure_region

  dynamic "basic" {
    for_each = var.type == "basic" ? [1] : []
    content {}
  }

  dynamic "standard" {
    for_each = var.type == "standard" ? [1] : []
    content {}
  }

  dynamic "dedicated" {
    for_each = var.type == "dedicated" ? [1] : []
    content {
      cku = 1
    }
  }

  environment {
    id = var.environment
  }
}
```

* `terraform.tfvars`:
```
type="standard"
example_kafka_cluster_name="test_cluster"
azure_region="centralus"
environment="env-12345"
```
* `variables.tf`:
```
variable "type" {
  type        = string
  description = "Type of Kafka cluster to deploy"
  validation {
    condition     = contains(["dedicated", "basic", "standard"], var.type)
    error_message = "Cluster type must be \"basic\", \"standard\", or \"dedicated\"."
  }
}

variable "example_kafka_cluster_name" {
  type        = string
  description = "Kafka Cluster name"
}

variable "azure_region" {
  type        = string
  description = "Azure region"
}

variable "environment" {
  type        = string
  description = "Environment ID"
}
```

### Testing
```
$ terraform validate
Success! The configuration is valid.

$ terraform plan

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # confluentcloud_kafka_cluster.example will be created
  + resource "confluentcloud_kafka_cluster" "example" {
      + api_version        = (known after apply)
      + availability       = "SINGLE_ZONE"
      + bootstrap_endpoint = (known after apply)
      + cloud              = "AZURE"
      + display_name       = "test_cluster"
      + http_endpoint      = (known after apply)
      + id                 = (known after apply)
      + kind               = (known after apply)
      + rbac_crn           = (known after apply)
      + region             = "centralus"

      + environment {
          + id = "env-12345"
        }

      + standard {}
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't guarantee to take exactly these actions if you run "terraform apply" now.
```